# Dressmaker - Easy

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1.
List the post code, order number, order date and garment descriptions for all items associated with Ms Brown.

In [2]:
%%sql
SELECT c_post_code post_code, order_no, order_date, description
  FROM jmcust JOIN dress_order ON (jmcust.c_no=dress_order.cust_no)  JOIN
    order_line ON (dress_order.order_no=order_line.order_ref) JOIN
    garment ON (garment.style_no=order_line.ol_style)
    WHERE c_name='Ms Brown'
UNION
SELECT d_post_code post_code, order_no, order_date, description
  FROM dressmaker JOIN construction ON (dressmaker.d_no=construction.maker) JOIN
    dress_order ON (dress_order.order_no=construction.order_ref) JOIN
    order_line ON (dress_order.order_no=order_line.order_ref) JOIN
    garment ON (garment.style_no=order_line.ol_style)
    WHERE d_name='Ms Brown';

 * postgresql://postgres:***@localhost/sqlzoo
4 rows affected.

[('B2 5AB   ', 7, datetime.date(2002, 2, 21), 'Short Skirt         '),
 ('B2 5AB   ', 7, datetime.date(2002, 2, 21), 'Suntop              '),
 ('B2 5AB   ', 9, datetime.date(2002, 2, 27), 'Shorts              '),
 ('B2 5AB   ', 7, datetime.date(2002, 2, 21), 'Sundress            ')]

## 2.
List the customer name, postal information, order date and order number of all orders that have been completed.

In [3]:
%%sql
SELECT c_name, c_post_code, order_date, order_no
  FROM jmcust JOIN dress_order ON (jmcust.c_no=dress_order.cust_no)  JOIN
    order_line ON (dress_order.order_no=order_line.order_ref)
    WHERE completed='Y';

 * postgresql://postgres:***@localhost/sqlzoo
11 rows affected.

[('Ms White            ', 'E24 8PQ  ', datetime.date(2002, 2, 3), 5),
 ('Ms White            ', 'E24 8PQ  ', datetime.date(2002, 2, 3), 5),
 ('Ms White            ', 'E24 8PQ  ', datetime.date(2002, 2, 3), 5),
 ('Mr Brass            ', 'FG24 9NM ', datetime.date(2002, 2, 2), 4),
 ('Mr Brass            ', 'FG24 9NM ', datetime.date(2002, 2, 2), 4),
 ('Ms Muir             ', 'H2 7CV   ', datetime.date(2002, 1, 20), 3),
 ('Dr Green            ', 'SJ4 4WE  ', datetime.date(2002, 1, 11), 2),
 ('Dr Green            ', 'SJ4 4WE  ', datetime.date(2002, 1, 11), 2),
 ('Dr Green            ', 'SJ4 4WE  ', datetime.date(2002, 1, 11), 2),
 ('Mrs Peacock         ', 'DD6 9NM  ', datetime.date(2002, 1, 10), 1),
 ('Mrs Peacock         ', 'DD6 9NM  ', datetime.date(2002, 1, 10), 1)]

## 3.
Which garments have been made or are being made from 'red abstract' or 'blue abstract' coloured materials.

In [4]:
%%sql
SELECT style_no, description, colour
  FROM garment JOIN order_line ON (garment.style_no=order_line.ol_style) JOIN
    material ON (order_line.ol_material=material.material_no)
    WHERE LOWER(colour) IN ('red abstract', 'blue abstract');

 * postgresql://postgres:***@localhost/sqlzoo
5 rows affected.

[(2, 'Long Skirt          ', 'Red Abstract        '),
 (2, 'Long Skirt          ', 'Blue Abstract       '),
 (5, 'Sundress            ', 'Red Abstract        '),
 (4, 'Short Skirt         ', 'Blue Abstract       '),
 (1, 'Trousers            ', 'Red Abstract        ')]

## 4.
How many garments has each dressmaker constructed? You should give the number of garments and the name and postal information of each dressmaker.

In [5]:
%%sql
SELECT d_name, d_post_code, COUNT(*)
  FROM dressmaker JOIN construction ON (dressmaker.d_no=construction.maker) JOIN
    dress_order ON (dress_order.order_no=construction.order_ref) JOIN
    order_line ON (order_line.order_ref=dress_order.order_no) JOIN
    garment ON (garment.style_no=order_line.ol_style)
    GROUP BY d_no;

 * postgresql://postgres:***@localhost/sqlzoo
7 rows affected.

[('Ms Sew              ', 'EF7 9KL ', 12),
 ('Mr Taylor           ', 'SH6 9RT ', 7),
 ('Miss Stitch         ', 'DF4 7HJ ', 20),
 ('Mr Needles          ', 'E12 6LG ', 12),
 ('Mr Seam             ', 'H45 7YH ', 12),
 ('Miss Pins           ', 'B4 9BL  ', 11),
 ('Mrs Hem             ', 'A12 6BC ', 14)]

## 5.
Give the names of those dressmakers who have finished items made from silk for completed orders.

In [6]:
%%sql
SELECT DiSTINCT d_name
  FROM dressmaker JOIN construction ON (dressmaker.d_no=construction.maker) JOIN
    dress_order ON (dress_order.order_no=construction.order_ref) JOIN
    order_line ON (order_line.order_ref=dress_order.order_no) JOIN
    garment ON (garment.style_no=order_line.ol_style) JOIN
    material ON (material.material_no=order_line.ol_material)
    WHERE LOWER(fabric)='silk' AND completed='Y';

 * postgresql://postgres:***@localhost/sqlzoo
5 rows affected.

[('Miss Pins           ',),
 ('Miss Stitch         ',),
 ('Mr Needles          ',),
 ('Mrs Hem             ',),
 ('Ms Sew              ',)]